N = input("Введите слово")

morse_code_dict = {' ': ' ', "a": ".-", "b": '-...', "c": "-.-.", "d": "-..", "e": '.', 'f': '..-.', 'g': '--.',
                     'h': '....', 'i': '..', 'j': '.---', 'k': '-.-', 'l': '.-..', 'm': '--', 'n': '-.', 'o': '---',
                     'p': '.--.', 'q': '--.-', 'r': '.-.', 's': '...', 't': '-', 'u': '..-', 'v': '...-', 'w': '.--',
                     'x': '-..-', 'y': '-.--', 'z': '--..', "A": ".-", "B": '-...', "C": "-.-.", "D": "-..", "E": '.',
                     'F': '..-.', 'G': '--.', 'H': '....', 'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--',
                     'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-', 'U': '..-',
                     'V': '...-', 'W': '.--', 'X': '-..-', 'Y': '-.--', 'Z': '--..', '1': '.----', '2': '..---',
                     '3': '...--', '4': '....-', '5': '.....', '6': '-....', '7': '--...', '8': '---..', '9': '----.',
                     '0': '-----'} # Создаем словарь для азбуки Морзе, где буквам и цифрам соответствуют их коды Морзе

s = [] # Создаем пустой список, в который будем добавлять коды Морзе для каждой буквы входной строки

for word in N:
    for letter in word: # Проходим по каждому символу во входной строке
        s.append(morse_code_dict[letter]) # Добавляем соответствующий код Морзе для символа в список

print(s) # Выводим закодированную строку Морзе